#  להזכירכם, במשימה שבסוף היחידה הקודמת עיצבתם מסך פתיחה מעוצב למשחק,
# (השגויים)ובנוסף הדפסתם למסך ערך אקראי המציין את מספר הניסיונות 
#  העומדים לרשות השחקן במשחק. בואו נבצע את התהליך שוב,
#  אך הפעם נשפר אותו ונכתוב אותו בצורה נכונה.

# כפי שלמדנו, כחלק מתהליך נכון של כתיבת קוד,
#  עלינו לתכנן וליצור משתנים. 
# בתרגיל זה תיצרו משתנים עבור התוכנית שלכם, ותדפיסו אותם.

# כתבו קטע קוד על פי הסעיפים הבאים:

# הגדירו את המשתנים:
# משתנה קבוע שנקרא HANGMAN_ASCII_ART. המשתנה יצביע על משפט הפתיחה והמחרוזת אותה הדפסתם כחלק מדף הפתיחה המעוצב שיצרתם.
# משתנה קבוע שנקרא MAX_TRIES. הערך של המשתנה מייצג את מספר הניסיונות הכושלים המירבי והוא 6.
# הדפיסו את מסך הפתיחה (בדומה לזה שהדפסתם במשימה המתגלגלת בסוף היחידה הקודמת) בפקודת הדפסה אחת. הפעם עשו זאת באמצעות שימוש במשתנים שהגדרתם.
# תזכורת לפלט הרצת התוכנית:

# הנחיות:
# הקפידו על פלט מדויק.
# כדי לרדת שורה (כלומר להתחיל שורה חדשה) כתבו את התו n\ במקום הרצוי במחרוזת.
# אל תהססו להיעזר בקוד שכתבתם בתרגיל שבסוף היחידה הקודמת.
# שאלה למחשבה: האם תוכלו להציע משתנים נוספים שעשויים להיות שימושיים בהמשך הדרך?

HANGMAN_ASCII_ART = \n "Welcome to the game Hangman"
"""
  _    _                                         
 | |  | |                                        
 | |__| | __ _ _ __   __ _ _ __ ___   __ _ _ __  
 |  __  |/ _` | '_ \ / _` | '_ ` _ \ / _` | '_ \ 
 | |  | | (_| | | | | (_| | | | | | | (_| | | | |
 |_|  |_|\__,_|_| |_|\__, |_| |_| |_|\__,_|_| |_|
                      __/ |                      
                     |___/
"""

int MAX_TRIES = 6