# אגדת "שלושת החזירונים הקטנים"
# מספרת על שלושה חזירים שחיו תחת איומו של זאב.
# במטרה לספק לעצמם מחסה מפניו,
# החלו לאסוף יחדיו חומרי בנייה.
# כתבו תוכנית שתציג את מספר הלבנים הכולל שאספו החזירים,
#  ואת מספר הלבנים שעומדות לרשות כל חזיר, על פי ההוראות הבאות.

# הנחיות
# התוכנית תקבל כקלט מספר תלת ספרתי (הניחו שהקלט תקין)
# . כל ספרה במספר זה מייצגת את מספר הלבנים שאסף חזיר אחר.
# התוכנית תדפיס את הפלט הבא:
# מספר הלבנים הכולל שאספו החזירונים (כלומר סכום שלוש הספרות)
# מספר הלבנים שיקבל כל חזיר אם יחלקו את מספר הלבנים הכולל שווה בין כולם
# שארית חלוקת הלבנים (כפי שחולקה בסעיף הקודם)
# True אם הסכום מתחלק בין שלושת החזירים ללא שארית, ו-False אחרת. שימו לב, אין להשתמש בהוראת תנאי
# אין להשתמש בלולאות.

# >>> Enter three digits (each digit for one pig): 124
# 7
# 2
# 1
# False

result = input("Enter three digits (each digit for one pig): ")
hundreds = result // 100
print(hundreds)
tens = result % 100
print(tens)
digit = result % 10
print(digit)
